"In the late summer of that year we lived in a house in a village that\nlooked across the river and the plain to the mountains. In the bed of\nthe river there were pebbles and boulders, dry and white in the sun, and\nthe water was clear and swiftly moving and blue in the channels. Troops\nwent by the house and down the road and the dust they raised powdered\nthe leaves of the trees. The trunks of the trees too were dusty and the\nleaves fell early that year and we saw the troops marching along the\nroad and the dust rising and leaves, stirred by the breeze, falling and\nthe soldiers marching and afterward the road bare and white except for\nthe leaves.\n\nThe plain was rich with crops; there were many orchards of fruit trees\nand beyond the plain the mountains were brown and bare. There was\nfighting in the mountains and at night we could see the flashes from the\nartillery. In the dark it was like summer lightning, but the nights were\ncool and there was not the feeling of a storm coming.\n\nSometimes in the dark we heard the troops marching under the window and\nguns going past pulled by motor-tractors. There was much traffic at\nnight and many mules on the roads with boxes of ammunition on each side\nof their pack-saddles and gray motor-trucks that carried men, and other\ntrucks with loads covered with canvas that moved slower in the traffic.\nThere were big guns too that passed in the day drawn by tractors, the\nlong barrels of the guns covered with green branches and green leafy\nbranches and vines laid over the tractors. To the north we could look\nacross a valley and see a forest of chestnut trees and behind it another\nmountain on this side of the river. There was fighting for that mountain\ntoo, but it was not successful, and in the fall when the rains came the\nleaves all fell from the chestnut trees and the branches were bare and\nthe trunks black with rain. The vineyards were thin and bare-branched\ntoo and all the country wet and brown and dead with the autumn. There\nwere mists over the river and clouds on the mountain and the trucks\nsplashed mud on the road and the troops were muddy and wet in their\ncapes; their rifles were wet and under their capes the two leather\ncartridge-boxes on the front of the belts, gray leather boxes heavy with\nthe packs of clips of thin, long 6.5 mm. cartridges, bulged forward\nunder the capes so that the men, passing on the road, marched as though\nthey were six months gone with child.\n\nThere were small gray motor-cars that passed going very fast; usually\nthere was an officer on the seat with the driver and more officers in\nthe back seat. They splashed more mud than the camions even and if one\nof the officers in the back was very small and sitting between two\ngenerals, he himself so small that you could not see his face but only\nthe top of his cap and his narrow back, and if the car went especially\nfast it was probably the King. He lived in Udine and came out in this\nway nearly every day to see how things were going, and things went very\nbadly.\n\nAt the start of the winter came the permanent rain and with the rain\ncame the cholera. But it was checked and in the end only seven thousand\ndied of it in the army.\n\nThe next year there were many victories. The mountain that was beyond\nthe valley and the hillside where the chestnut forest grew was captured\nand there were victories beyond the plain on the plateau to the south\nand we crossed the river in August and lived in a house in Gorizia that\nhad a fountain and many thick shady trees in a walled garden and a\nwistaria vine purple on the side of the house. Now the fighting was in\nthe next mountains beyond and was not a mile away. The town was very\nnice and our house was very fine. The river ran behind us and the town\nhad been captured very handsomely but the mountains beyond it could not\nbe taken and I was very glad the Austrians seemed to want to come back\nto the town some time, if the war should end, because they did not\nbombard it to destroy it but only a little in a military way. People\nlived on in it and there were hospitals and cafés and artillery up side\nstreets and two bawdy houses, one for troops and one for officers, and\nwith the end of the summer, the cool nights, the fighting in the\nmountains beyond the town, the shell-marked iron of the railway bridge,\nthe smashed tunnel by the river where the fighting had been, the trees\naround the square and the long avenue of trees that led to the square;\nthese with there being girls in the town, the King passing in his motor\ncar, sometimes now seeing his face and little long necked body and gray\nbeard like a goat’s chin tuft; all these with the sudden interiors of\nhouses that had lost a wall through shelling, with plaster and rubble in\ntheir gardens and sometimes in the street, and the whole thing going\nwell on the Carso made the fall very different from the last fall when\nwe had been in the country. The war was changed too.\n\nThe forest of oak trees on the mountain beyond the town was gone. The\nforest had been green in the summer when we had come into the town but\nnow there were the stumps and the broken trunks and the ground torn up,\nand one day at the end of the fall when I was out where the oak forest\nhad been I saw a cloud coming over the mountain. It came very fast and\nthe sun went a dull yellow and then everything was gray and the sky was\ncovered and the cloud came on down the mountain and suddenly we were in\nit and it was snow. The snow slanted across the wind, the bare ground\nwas covered, the stumps of trees projected, there was snow on the guns\nand there were paths in the snow going back to the latrines behind\ntrenches.\n\nLater, below in the town, I watched the snow falling, looking out of the\nwindow of the bawdy house, the house for officers, where I sat with a\nfriend and two glasses drinking a bottle of Asti, and, looking out at\nthe snow falling slowly and heavily, we knew it was all over for that\nyear. Up the river the mountains had not been taken; none of the\nmountains beyond the river had been taken. That was all left for next\nyear. My friend saw the priest from our mess going by in the street,\nwalking carefully in the slush, and pounded on the window to attract his\nattention. The priest looked up. He saw us and smiled. My friend\nmotioned for him to come in. The priest shook his head and went on. That\nnight in the mess after the spaghetti course, which every one ate very\nquickly and seriously, lifting the spaghetti on the fork until the loose\nstrands hung clear then lowering it into the mouth, or else using a\ncontinuous lift and sucking into the mouth, helping ourselves to wine\nfrom the grass-covered gallon flask; it swung in a metal cradle and you\npulled the neck of the flask down with the forefinger and the wine,\nclear red, tannic and lovely, poured out into the glass held with the\nsame hand; after this course, the captain commenced picking on the\npriest.\n\nThe priest was young and blushed easily and wore a uniform like the rest\nof us but with a cross in dark red velvet above the left breast pocket\nof his gray tunic. The captain spoke pidgin Italian for my doubtful\nbenefit, in order that I might understand perfectly, that nothing should\nbe lost.\n\n“Priest to-day with girls,” the captain said looking at the priest and\nat me. The priest smiled and blushed and shook his head. This captain\nbaited him often.\n\n“Not true?” asked the captain. “To-day I see priest with girls.”\n\n“No,” said the priest. The other officers were amused at the baiting.\n\n“Priest not with girls,” went on the captain. “Priest never with girls,”\nhe explained to me. He took my glass and filled it, looking at my eyes\nall the time, but not losing sight of the priest.\n\n“Priest every night five against one.” Every one at the table laughed.\n“You understand? Priest every night five against one.” He made a gesture\nand laughed loudly. The priest accepted it as a joke.\n\n“The Pope wants the Austrians to win the war,” the major said. “He loves\nFranz Joseph. That’s where the money comes from. I am an atheist.”\n\n“Did you ever read the ‘Black Pig’?” asked the lieutenant. “I will get\nyou a copy. It was that which shook my faith.”\n\n“It is a filthy and vile book,” said the priest. “You do not really like\nit.”\n\n“It is very valuable,” said the lieutenant. “It tells you about those\npriests. You will like it,” he said to me. I smiled at the priest and he\nsmiled back across the candle-light. “Don’t you read it,” he said.\n\n“I will get it for you,” said the lieutenant.\n\n“All thinking men are atheists,” the major said. “I do not believe in\nthe Free Masons however.”\n\n“I believe in the Free Masons,” the lieutenant said. “It is a noble\norganization.” Some one came in and as the door opened I could see the\nsnow falling.\n\n“There will be no more offensive now that the snow has come,” I said.\n\n“Certainly not,” said the major. “You should go on leave. You should go\nto Rome, Naples, Sicily——”\n\n“He should visit Amalfi,” said the lieutenant “I will write you cards to\nmy family in Amalfi. They will love you like a son.”\n\n“He should go to Palermo.”\n\n“He ought to go to Capri.”\n\n“I would like you to see Abruzzi and visit my family at Capracotta,”\nsaid the priest.\n\n“Listen to him talk about the Abruzzi. There’s more snow there than\nhere. He doesn’t want to see peasants. Let him go to centres of culture\nand civilization.”\n\n“He should have fine girls. I will give you the addresses of places in\nNaples. Beautiful young girls—accompanied by their mothers. Ha! Ha!\nHa!” The captain spread his hand open, the thumb up and fingers\noutspread as when you make shadow pictures. There was a shadow from his\nhand on the wall. He spoke again in pidgin Italian. “You go away like\nthis,” he pointed to the thumb, “and come back like this,” he touched\nthe little finger. Every one laughed.\n\n“Look,” said the captain. He spread the hand again. Again the\ncandle-light made its shadows on the wall. He started with the upright\nthumb and named in their order the thumb and four fingers, “soto-tenente\n(the thumb), tenente (first finger), capitano (next finger), maggiore\n(next to the little finger), and tenente-colonello (the little finger).\nYou go away soto-tenente! You come back soto-colonello!” They all\nlaughed. The captain was having a great success with finger games. He\nlooked at the priest and shouted, “Every night priest five against one!”\nThey all laughed again.\n\n“You must go on leave at once,” the major said.\n\n“I would like to go with you and show you things,” the lieutenant said.\n\n“When you come back bring a phonograph.”\n\n“Bring good opera disks.”\n\n“Bring Caruso.”\n\n“Don’t bring Caruso. He bellows.”\n\n“Don’t you wish you could bellow like him?”\n\n“He bellows. I say he bellows!”\n\n“I would like you to go to Abruzzi,” the priest said. The others were\nshouting. “There is good hunting. You would like the people and though\nit is cold it is clear and dry. You could stay with my family. My father\nis a famous hunter.”\n\n“Come on,” said the captain. “We go whorehouse before it shuts.”\n\n“Good-night,” I said to the priest.\n\n“Good-night,” he said."